sysbench/output/cacheline128/oltp-point-select.out
sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 1 tps: 11926.01 qps: 11926.01 (r/w/o: 11926.01/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 11843.01 qps: 11843.01 (r/w/o: 11843.01/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 11839.34 qps: 11839.34 (r/w/o: 11839.34/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 11809.54 qps: 11809.54 (r/w/o: 11809.54/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 11676.71 qps: 11676.71 (r/w/o: 11676.71/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 11638.99 qps: 11638.99 (r/w/o: 11638.99/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1 tps: 11768.01 qps: 11768.01 (r/w/o: 11768.01/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 11804.58 qps: 11804.58 (r/w/o: 11804.58/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1 tps: 11807.95 qps: 11807.95 (r/w/o: 11807.95/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 11865.04 qps: 11865.04 (r/w/o: 11865.04/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1 tps: 11649.21 qps: 11649.21 (r/w/o: 11649.21/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            707004
        write:                           0
        other:                           0
        total:                           707004
    transactions:                        707004 (11783.00 per sec.)
    queries:                             707004 (11783.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      11782.9962
    time elapsed:                        60.0021s
    total number of events:              707004

Latency (ms):
         min:                                    0.07
         avg:                                    0.08
         max:                                    6.84
         95th percentile:                        0.10
         sum:                                59716.06

Threads fairness:
    events (avg/stddev):           707004.0000/0.00
    execution time (avg/stddev):   59.7161/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 2 tps: 23472.36 qps: 23472.36 (r/w/o: 23472.36/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 2 tps: 23495.21 qps: 23495.21 (r/w/o: 23495.21/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 2 tps: 23438.37 qps: 23438.37 (r/w/o: 23438.37/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 23426.55 qps: 23426.55 (r/w/o: 23426.55/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 2 tps: 23548.71 qps: 23548.71 (r/w/o: 23548.71/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 22374.24 qps: 22374.24 (r/w/o: 22374.24/0.00/0.00) lat (ms,95%): 0.11 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 2 tps: 23307.83 qps: 23307.83 (r/w/o: 23307.83/0.00/0.00) lat (ms,95%): 0.11 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 23355.21 qps: 23355.21 (r/w/o: 23355.21/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 2 tps: 23480.07 qps: 23480.07 (r/w/o: 23480.07/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 23561.81 qps: 23561.81 (r/w/o: 23561.81/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 2 tps: 22775.53 qps: 22775.53 (r/w/o: 22775.53/0.00/0.00) lat (ms,95%): 0.11 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1398811
        write:                           0
        other:                           0
        total:                           1398811
    transactions:                        1398811 (23312.71 per sec.)
    queries:                             1398811 (23312.71 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      23312.7064
    time elapsed:                        60.0021s
    total number of events:              1398811

Latency (ms):
         min:                                    0.07
         avg:                                    0.09
         max:                                   10.61
         95th percentile:                        0.10
         sum:                               119450.19

Threads fairness:
    events (avg/stddev):           699405.5000/328.50
    execution time (avg/stddev):   59.7251/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 43805.21 qps: 43805.21 (r/w/o: 43805.21/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 44361.01 qps: 44361.01 (r/w/o: 44361.01/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 41333.00 qps: 41333.00 (r/w/o: 41333.00/0.00/0.00) lat (ms,95%): 0.13 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 44345.14 qps: 44345.14 (r/w/o: 44345.14/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 41095.90 qps: 41095.90 (r/w/o: 41095.90/0.00/0.00) lat (ms,95%): 0.14 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 36515.70 qps: 36515.70 (r/w/o: 36515.70/0.00/0.00) lat (ms,95%): 0.16 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 38016.76 qps: 38016.76 (r/w/o: 38016.76/0.00/0.00) lat (ms,95%): 0.16 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 43978.71 qps: 43978.71 (r/w/o: 43978.71/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 43926.46 qps: 43926.46 (r/w/o: 43926.46/0.00/0.00) lat (ms,95%): 0.10 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 39502.87 qps: 39502.87 (r/w/o: 39502.87/0.00/0.00) lat (ms,95%): 0.15 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 33854.55 qps: 33854.55 (r/w/o: 33854.55/0.00/0.00) lat (ms,95%): 0.16 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2445268
        write:                           0
        other:                           0
        total:                           2445268
    transactions:                        2445268 (40752.87 per sec.)
    queries:                             2445268 (40752.87 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      40752.8747
    time elapsed:                        60.0023s
    total number of events:              2445268

Latency (ms):
         min:                                    0.07
         avg:                                    0.10
         max:                                   29.95
         95th percentile:                        0.14
         sum:                               237922.90

Threads fairness:
    events (avg/stddev):           611317.0000/6707.13
    execution time (avg/stddev):   59.4807/0.01

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 42601.18 qps: 42601.18 (r/w/o: 42601.18/0.00/0.00) lat (ms,95%): 0.26 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 42898.62 qps: 42898.62 (r/w/o: 42898.62/0.00/0.00) lat (ms,95%): 0.21 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 42533.30 qps: 42533.30 (r/w/o: 42533.30/0.00/0.00) lat (ms,95%): 0.21 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 42753.42 qps: 42753.42 (r/w/o: 42753.42/0.00/0.00) lat (ms,95%): 0.27 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 41622.67 qps: 41622.67 (r/w/o: 41622.67/0.00/0.00) lat (ms,95%): 0.29 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 41169.07 qps: 41169.07 (r/w/o: 41169.07/0.00/0.00) lat (ms,95%): 0.32 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 34218.56 qps: 34218.56 (r/w/o: 34218.56/0.00/0.00) lat (ms,95%): 0.39 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 41718.84 qps: 41718.84 (r/w/o: 41718.84/0.00/0.00) lat (ms,95%): 0.30 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 42478.77 qps: 42478.77 (r/w/o: 42478.77/0.00/0.00) lat (ms,95%): 0.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 40674.03 qps: 40674.03 (r/w/o: 40674.03/0.00/0.00) lat (ms,95%): 0.33 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 38107.26 qps: 38107.26 (r/w/o: 38107.26/0.00/0.00) lat (ms,95%): 0.32 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2456387
        write:                           0
        other:                           0
        total:                           2456387
    transactions:                        2456387 (40938.54 per sec.)
    queries:                             2456387 (40938.54 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      40938.5414
    time elapsed:                        60.0018s
    total number of events:              2456387

Latency (ms):
         min:                                    0.07
         avg:                                    0.19
         max:                                   24.73
         95th percentile:                        0.30
         sum:                               477865.67

Threads fairness:
    events (avg/stddev):           307048.3750/7267.40
    execution time (avg/stddev):   59.7332/0.02

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 16 tps: 40553.41 qps: 40553.41 (r/w/o: 40553.41/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 16 tps: 40922.67 qps: 40922.67 (r/w/o: 40922.67/0.00/0.00) lat (ms,95%): 0.56 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 16 tps: 40550.05 qps: 40550.05 (r/w/o: 40550.05/0.00/0.00) lat (ms,95%): 0.53 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 40820.48 qps: 40820.48 (r/w/o: 40820.48/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 16 tps: 40418.24 qps: 40418.24 (r/w/o: 40418.24/0.00/0.00) lat (ms,95%): 0.64 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 41010.68 qps: 41010.68 (r/w/o: 41010.68/0.00/0.00) lat (ms,95%): 0.56 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 16 tps: 36644.69 qps: 36644.69 (r/w/o: 36644.69/0.00/0.00) lat (ms,95%): 0.67 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 37225.21 qps: 37225.21 (r/w/o: 37225.21/0.00/0.00) lat (ms,95%): 0.67 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 16 tps: 40673.65 qps: 40673.65 (r/w/o: 40673.65/0.00/0.00) lat (ms,95%): 0.55 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 40731.58 qps: 40731.58 (r/w/o: 40731.58/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 16 tps: 39172.98 qps: 39172.98 (r/w/o: 39172.98/0.00/0.00) lat (ms,95%): 0.57 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2387995
        write:                           0
        other:                           0
        total:                           2387995
    transactions:                        2387995 (39797.41 per sec.)
    queries:                             2387995 (39797.41 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      39797.4064
    time elapsed:                        60.0038s
    total number of events:              2387995

Latency (ms):
         min:                                    0.08
         avg:                                    0.40
         max:                                   37.84
         95th percentile:                        0.60
         sum:                               957825.79

Threads fairness:
    events (avg/stddev):           149249.6875/4280.04
    execution time (avg/stddev):   59.8641/0.02

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 32 tps: 42670.22 qps: 42670.22 (r/w/o: 42670.22/0.00/0.00) lat (ms,95%): 0.68 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 32 tps: 43403.17 qps: 43403.17 (r/w/o: 43403.17/0.00/0.00) lat (ms,95%): 0.17 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 32 tps: 43104.90 qps: 43104.90 (r/w/o: 43104.90/0.00/0.00) lat (ms,95%): 0.39 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 42186.35 qps: 42186.35 (r/w/o: 42186.35/0.00/0.00) lat (ms,95%): 0.77 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 32 tps: 42629.20 qps: 42629.20 (r/w/o: 42629.20/0.00/0.00) lat (ms,95%): 0.74 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 42961.20 qps: 42961.20 (r/w/o: 42961.20/0.00/0.00) lat (ms,95%): 0.55 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 32 tps: 43119.17 qps: 43119.17 (r/w/o: 43119.17/0.00/0.00) lat (ms,95%): 0.43 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 35397.02 qps: 35397.02 (r/w/o: 35397.02/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 32 tps: 42837.57 qps: 42837.57 (r/w/o: 42837.57/0.00/0.00) lat (ms,95%): 0.43 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 42616.51 qps: 42616.51 (r/w/o: 42616.51/0.00/0.00) lat (ms,95%): 0.65 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 32 tps: 42402.90 qps: 42402.90 (r/w/o: 42402.90/0.00/0.00) lat (ms,95%): 0.67 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2511014
        write:                           0
        other:                           0
        total:                           2511014
    transactions:                        2511014 (41845.95 per sec.)
    queries:                             2511014 (41845.95 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      41845.9544
    time elapsed:                        60.0061s
    total number of events:              2511014

Latency (ms):
         min:                                    0.07
         avg:                                    0.76
         max:                                  127.78
         95th percentile:                        0.63
         sum:                              1917637.05

Threads fairness:
    events (avg/stddev):           78469.1875/1414.28
    execution time (avg/stddev):   59.9262/0.03